In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.read_csv("Exchange Rate Data.csv")

In [ ]:
df.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME     Value  Flag Codes
0      AUS      EXCH     TOT  NATUSD         A  1981  0.870215         NaN
1      AUS      EXCH     TOT  NATUSD         A  1982  0.985863         NaN
2      AUS      EXCH     TOT  NATUSD         A  1983  1.110015         NaN
3      AUS      EXCH     TOT  NATUSD         A  1984  1.139519         NaN
4      AUS      EXCH     TOT  NATUSD         A  1985  1.431895         NaN

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2256 entries, 0 to 2255
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   LOCATION    2256 non-null   object
 1   INDICATOR   2256 non-null   object
 2   SUBJECT     2256 non-null   object
 3   MEASURE     2256 non-null   object
 4   FREQUENCY   2256 non-null   object
 5   TIME        2256 non-null   int64
 6   Value       2256 non-null   float64
 7   Flag Codes  0 non-null      float64
dtypes: float64(2), int64(1), object(5)
memory usage: 141.1+ KB

In [ ]:
df.describe()

              TIME         Value  Flag Codes
count  2256.000000   2256.000000         0.0
mean   2001.252216    212.719646         NaN
std      11.271798   1142.457562         NaN
min    1981.000000      0.000000         NaN
25%    1992.000000      0.846773         NaN
50%    2002.000000      1.504899         NaN
75%    2011.000000      9.112342         NaN
max    2020.000000  14582.203468         NaN

In [ ]:
new_df=df[['LOCATION','TIME','Value']]

In [ ]:
new_df.head()

  LOCATION  TIME     Value
0      AUS  1981  0.870215
1      AUS  1982  0.985863
2      AUS  1983  1.110015
3      AUS  1984  1.139519
4      AUS  1985  1.431895

In [ ]:
Year = list(range(1981, 2021))

In [ ]:
df['LOCATION'].unique()

array(['AUS', 'AUT', 'BEL', 'CAN', 'CZE', 'DNK', 'FIN', 'FRA', 'DEU',
       'GRC', 'HUN', 'ISL', 'IRL', 'ITA', 'JPN', 'KOR', 'LUX', 'MEX',
       'NLD', 'NZL', 'NOR', 'POL', 'PRT', 'SVK', 'ESP', 'SWE', 'CHE',
       'TUR', 'GBR', 'USA', 'BRA', 'CHL', 'CHN', 'COL', 'EST', 'IND',
       'IDN', 'ISR', 'RUS', 'SVN', 'ZAF', 'DEW', 'EU28', 'LVA', 'LTU',
       'SAU', 'EA19', 'ARG', 'CRI', 'BGR', 'HRV', 'CYP', 'MLT', 'PER',
       'ROU', 'MKD', 'MDG', 'MAR', 'ZMB', 'SRB', 'HKG'], dtype=object)

In [ ]:
Countries=['CHN','IND','JPN','GBR','SWE','CAN']

In [ ]:
data={'Country':Countries}
fin_df=pd.DataFrame(data)
fin_df.head(6)

  Country
0     CHN
1     IND
2     JPN
3     GBR
4     SWE
5     CAN

In [ ]:
for country in Countries:
    for year in Year:
        fin_df[year]=new_df['Value'] if (new_df['LOCATION']==country)&(new_df['TIME']==year)

SyntaxError: ignored

In [ ]:
df1 = df.set_index('LOCATION')

In [ ]:
df2 = df1.loc[['CHN','IND','JPN','GBR','SWE','CAN']]
df2.head(100)

         INDICATOR SUBJECT MEASURE FREQUENCY  TIME       Value  Flag Codes
LOCATION
CHN           EXCH     TOT  NATUSD         A  1981    1.704542         NaN
CHN           EXCH     TOT  NATUSD         A  1982    1.892542         NaN
CHN           EXCH     TOT  NATUSD         A  1983    1.975675         NaN
CHN           EXCH     TOT  NATUSD         A  1984    2.320042         NaN
CHN           EXCH     TOT  NATUSD         A  1985    2.936658         NaN
...            ...     ...     ...       ...   ...         ...         ...
JPN           EXCH     TOT  NATUSD         A  1996  108.779057         NaN
JPN           EXCH     TOT  NATUSD         A  1997  120.990863         NaN
JPN           EXCH     TOT  NATUSD         A  1998  130.905301         NaN
JPN           EXCH     TOT  NATUSD         A  1999  113.906805         NaN
JPN           EXCH     TOT  NATUSD         A  2000  107.765498         NaN

[100 rows x 7 columns]

In [ ]:
df3 = df2.loc[:,['TIME','Value']]
df3.head(100)

          TIME       Value
LOCATION
CHN       1981    1.704542
CHN       1982    1.892542
CHN       1983    1.975675
CHN       1984    2.320042
CHN       1985    2.936658
...        ...         ...
JPN       1996  108.779057
JPN       1997  120.990863
JPN       1998  130.905301
JPN       1999  113.906805
JPN       2000  107.765498

[100 rows x 2 columns]

In [ ]:
Exchange_Rates_Yearly=pd.DataFrame()
Exchange_Rates_Yearly.to_csv=('Exchange_Rates.csv')